/**
 * Напишите функцию createList(array)
 * Принимает массив элементов
 * Возвращает связный список, где каждый элемент массива является значением узла списка, а связи между узлами создаются последовательно.
 *
 * Пример:
 * const array = [1, 2, 3, 4, 5];
 *
 * Вернёт:
 *  {
 *    value: 1,
 *    next: {
 *      value: 2,
 *      next: {
 *        value: 3,
 *        next: {
 *          value: 4,
 *          next: {
 *            value: 5,
 *            next: null
 *          }
 *        }
 *      }
 *    }
 *  }
 * Если массив пустой, то функция должна вернуть null.
 * Если массив содержит только один элемент, то функция должна вернуть связный список из одного узла.
 */
function createList(arr) {
  
}
